//** @file
//   Strings for Console Redirection Config DXE
//
//;******************************************************************************
//;* Copyright (c) 2015, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************

/=#

#include "Standard.uni"
#string STR_EFI_SETUP_UTILITY_TITLE     #language en-US        "InsydeH2O Setup Utility"
                                        #language fr-FR        "Logiciel de Configuration d'InsydeH2O"
                                        #language zh-TW        "\wide系微\narrow H2O \wide設定工具\narrow"
                                        #language ja-JP        "InsydeH2O \wideセットアップユーティリティ\narrow"
                                        #language it-IT        "Configuratore InsydeH2O"
                                        #language es-ES        "Utilitario de la programación de InsydeH2O"
                                        #language de-DE        "InsydeH2O-Anbringung"
                                        #language pt-PT        "Configura Utilidade do InsydeH2O"
#string STR_BLANK_STRING                #language en-US        " "
                                        #language fr-FR        " "
                                        #language zh-TW        " "
                                        #language ja-JP        " "
                                        #language it-IT        " "
                                        #language es-ES        " "
                                        #language de-DE        " "
                                        #language pt-PT        " "
#string STR_YES_TEXT                    #language en-US        "Yes"
                                        #language fr-FR        "Oui"
                                        #language zh-TW        "\wide是\narrow"
                                        #language ja-JP        "\wideはい\narrow"
                                        #language it-IT        "Si"
                                        #language es-ES        "Sí"
                                        #language de-DE        "Ja"
                                        #language pt-PT        "Sim"
#string STR_NO_TEXT                     #language en-US        "No"
                                        #language fr-FR        "Non"
                                        #language zh-TW        "\wide否\narrow"
                                        #language ja-JP        "\wideいいえ\narrow"
                                        #language it-IT        "No"
                                        #language es-ES        "Sí"
                                        #language de-DE        "Nein"
                                        #language pt-PT        "Não"
#string STR_DISABLED_TEXT               #language en-US        "Disabled"
                                        #language fr-FR        "Désactiver"
                                        #language zh-TW        "\wide停用\narrow"
                                        #language ja-JP        "\wide無効\narrow"
                                        #language it-IT        "Disabilitato"
                                        #language es-ES        "inhabilitado"
                                        #language de-DE        "Sperren"
                                        #language pt-PT        "Proibir"
#string STR_ENABLED_TEXT                #language en-US        "Enabled"
                                        #language fr-FR        "Activer"
                                        #language zh-TW        "\wide啟用\narrow"
                                        #language ja-JP        "\wide有効\narrow"
                                        #language it-IT        "abilitato"
                                        #language es-ES        "permitido"
                                        #language de-DE        "Aktivieren"
                                        #language pt-PT        "Permitir"
#string STR_AUTO_TEXT                   #language en-US        "Auto"
                                        #language fr-FR        "Automatique"
                                        #language zh-TW        "\wide自動\narrow"
                                        #language ja-JP        "\wide自動\narrow"
                                        #language it-IT        "Auto"
                                        #language es-ES        "Auto"
                                        #language de-DE        "Automatisch"
                                        #language pt-PT        "Auto"                                   

#string STR_CR_CONSOLE_REDIRECTION      #language en-US        "Console Serial Redirect"
                                        #language ja-JP        "\wideコンソールシリアルリダイレクション\narrow"
#string STR_CR_CONSOLE_REDIRECTION_HELP #language en-US        "Enable Console Redirection Function"
                                        #language ja-JP        "\wideコンソールシリアルリダイレクション機能の有効/無効を選択します。\narrow" 

#string STR_CONSOLE_REDIRECTION_FORMSET_TITLE        #language en-US        "Console Redirection"
                                                     #language fr-FR        "Console Redirection"
                                                     #language ja-JP        "\wideコンソールリダイレクション\narrow"
                                        
#string STR_CONSOLE_REDIRECTION_FORMSET_HELP         #language en-US        "Console Redirection Settings"
                                                     #language fr-FR        "Console Redirection Settings"
                                                     #language ja-JP        "\wideコンソールリダイレクション設定\narrow"

#string STR_STR_CONSOLE_REDIRECTION_TITLE            #language en-US        "Console Redirection Setup"
                                                     #language fr-FR        "Console Redirection Setup"
                                                     #language ja-JP        "\wideコンソールリダイレクトメニュー\narrow"

#string STR_STR_CR_DEVICE_TITLE                      #language en-US        "Console Redirection Device Setup"
                                                     #language fr-FR        "Console Redirection Device Setup"
                                                     
#string STR_CR_DEVICE_0_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_1_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_2_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_3_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_4_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_5_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_6_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_7_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_8_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_9_TITLE                        #language en-US        "Console Redirection Device Setup"
                                        
#string STR_CR_LOGO_WAIT_TIME           #language en-US        "Information Wait Time"
                                        #language ja-JP        "\wideファームウェア情報表示時間\narrow"
#string STR_CR_LOGO_WAIT_TIME_HELP      #language en-US        "Set Console Redirection port information display time"
                                        #language ja-JP        "\wideコンソールリダイレクションのポート情報の表示時間を設定します。\narrow"
#string STR_CR_LOGO_WAIT_0_SECOND       #language en-US        " 0 Second"
#string STR_CR_LOGO_WAIT_2_SECOND       #language en-US        " 2 Seconds"
#string STR_CR_LOGO_WAIT_5_SECOND       #language en-US        " 5 Seconds"
#string STR_CR_LOGO_WAIT_10_SECOND      #language en-US        "10 Seconds"
#string STR_CR_LOGO_WAIT_30_SECOND      #language en-US        "30 Seconds"
#string STR_CR_LOGO_WAIT_A_KEY          #language en-US        "Wait a Key"
                                        
#string STR_CR_TERMINAL_TYPE            #language en-US        "Terminal Type"
                                        #language ja-JP        "\wide端末タイプ\narrow"
#string STR_CR_TERMINAL_TYPE_HELP       #language en-US        "Set Console Redirection terminal type"
                                        #language ja-JP        "\wideコンソールリダイレクションに対する対象端末エミュレーションタイプを選択します。\narrow"

#string STR_CR_TERMINAL_TYPE_VT100      #language en-US        "VT_100"
#string STR_CR_TERMINAL_TYPE_VT100P     #language en-US        "VT_100+"
#string STR_CR_TERMINAL_TYPE_VTUTF8     #language en-US        "VT_UTF8"
#string STR_CR_TERMINAL_TYPE_ANSI       #language en-US        "PC_ANSI"
#string STR_CR_TERMINAL_TYPE_LOG        #language en-US        "LOG_TERM"


#string STR_CR_AUTO_REFRESH             #language en-US        "Auto Refresh"
#string STR_CR_AUTO_REFRESH_HELP        #language en-US        "When feature enable, screen will be auto refresh once after detect remote terminal was connected"

#string STR_CR_FAIL_SAFE_BAUDRATE       #language en-US        "FailSafeBaudRate"
#string STR_CR_FAIL_SAFE_BAUDRATE_HELP  #language en-US        "This feature will auto detect remote terminal baud rate and connect C.R serial device with detected baud rate"

#string STR_CR_PORT_ENABLE              #language en-US        "PortEnable"
#string STR_CR_PORT_ENABLE_HELP         #language en-US        "Enable/Disable C.R. on this serial port."

#string STR_CR_AFTER_POST               #language en-US        "C.R. After Legacy Boot"
#string STR_CR_AFTER_POST_HELP          #language en-US        "Console Redirection continue works after Legacy Boot."

#string STR_CR_TEXT_MODE_RES            #language en-US        "Text Mode Resolution"
#string STR_CR_TEXT_MODE_RES_HELP       #language en-US        "Console Redirection Text Mode Resolution. Changing this setting will affect the VGA resolution.\n\nAuto:\nFollow VGA text mode.\n\nForce 80x25:\nDon't care VGA, force text mode be 80x25 (VGA 640x480).\n\nForce 80x24 (DEL FIRST ROW):\nDon't care VGA, force text mode be 80x24, Del First Row.\n\nForce 80x24 (DEL LAST ROW):\nDon't care VGA, force text mode be 80x24, Del Last Row.\n\nLimit 128x40:\nLimit the VGA max text mode on 128x40 (VGA 1024x768)."

#string STR_CR_TEXT_MODE_AUTO           #language en-US        "AUTO"
#string STR_CR_TEXT_MODE_80X25          #language en-US        "Force 80x25"
#string STR_CR_TEXT_MODE_80X24_DF       #language en-US        "Force 80x24 (DEL FIRST ROW)"
#string STR_CR_TEXT_MODE_80X24_DL       #language en-US        "Force 80x24 (DEL LAST ROW)"
#string STR_CR_TEXT_MODE_128X40         #language en-US        "Limit 128x40"

#string STR_SPCR_SUPPORT_STRING         #language en-US        "ACPI SPCR Table"
#string STR_SPCR_SUPPORT_HELP           #language en-US        "Serial Port Console Redirection Table : Enabled this feature, the SPCR table will be add-into ACPI Tables."

#string STR_CR_USE_GLOBAL_SETTING          #language en-US        "UseGlobalSetting"
#string STR_CR_CR_USE_GLOBAL_SETTING_HELP  #language en-US        "Enable: C.R. will use global setting for this serial port.\nDisable: C.R. will use local setting for this serial port."

#string STR_CR_SERIAL_PORT              #language en-US        "Serial Port"

#string STR_CR_SERIAL_PORT_HELP         #language en-US        "Set Console Redirection port"

#string STR_CR_SERIAL_PORTA             #language en-US        "COM_A"
#string STR_CR_SERIAL_PORTB             #language en-US        "COM_B"
#string STR_CR_SERIAL_PORTC             #language en-US        "COM_C"
#string STR_CR_SERIAL_PORTD             #language en-US        "COM_D"

#string STR_CR_PCI_ONLY                 #language en-US        "PCI Device"

#string STR_CR_SERIAL_ALL               #language en-US        "All Device Ports"

#string STR_CR_BAUD_RATE                #language en-US        "Baud Rate"
                                        #language ja-JP        "\wideボーレート\narrow"
#string STR_CR_BAUD_RATE_HELP           #language en-US        "Set Console Redirection baud rate"
                                        #language ja-JP        "\wideコンソールリダイレクションのボーレートを選択します。\narrow"

#string STR_CR_BAUD_RATE_115200         #language en-US        "115200"
#string STR_CR_BAUD_RATE_57600          #language en-US        " 57600"
#string STR_CR_BAUD_RATE_38400          #language en-US        " 38400"
#string STR_CR_BAUD_RATE_19200          #language en-US        " 19200"
#string STR_CR_BAUD_RATE_9600           #language en-US        "  9600"
#string STR_CR_BAUD_RATE_4800           #language en-US        "  4800"
#string STR_CR_BAUD_RATE_2400           #language en-US        "  2400"
#string STR_CR_BAUD_RATE_1200           #language en-US        "  1200"
#string STR_CR_BAUD_RATE_300            #language en-US        "   300"

#string STR_CR_DATA_BIT                 #language en-US        "Data Bits" 
                                        #language ja-JP        "\wideデータビット\narrow"
#string STR_CR_DATA_BIT_HELP            #language en-US        "Set Console Redirection data bits"
                                        #language ja-JP        "\wideシリアルポートリダイレクトのデータ転送サイズを選択します。\narrow"

#string STR_CR_DATA_BIT_7               #language en-US        "7 Bits" 
#string STR_CR_DATA_BIT_8               #language en-US        "8 Bits"

#string STR_CR_STOP_BIT                 #language en-US        "Stop Bits"
                                        #language ja-JP        "\wide停止ビット\narrow"
#string STR_CR_STOP_BIT_HELP            #language en-US        "Set Console Redirection stop bits"
                                        #language ja-JP        "\wideシリアルデータパケットの終端を示す停止ビットを選択します。\narrow"

#string STR_CR_STOP_BIT_1               #language en-US        "1 Bit"
                                        #language ja-JP        "1\wideビット\narrow"
#string STR_CR_STOP_BIT_2               #language en-US        "2 Bits"
                                        #language ja-JP        "2\wideビット\narrow"
 
#string STR_CR_PARITY                   #language en-US        "Parity"
                                        #language ja-JP        "\wideパリティ\narrow"
#string STR_CR_PARITY_HELP              #language en-US        "Set Console Redirection parity bits"
                                        #language ja-JP        "\wideデータ送信エラーを検出するために、通常のデータビットでパリティビットを送信するオプションを選択します。\narrow"
#string STR_CR_PARITY_NONE              #language en-US        "None"
#string STR_CR_PARITY_EVEN              #language en-US        "Even" 
#string STR_CR_PARITY_ODD               #language en-US        "Odd"

#string STR_CR_FLOW_CONTROL             #language en-US        "Flow Control"
                                        #language ja-JP        "\wideフロー制御\narrow"
#string STR_CR_FLOW_CONTROL_HELP        #language en-US        "Set Console Redirection flow control type"
                                        #language ja-JP        "\wideコンソールリダイレクションのフロー制御を選択します。\narrow" 

#string STR_CR_FLOW_CONTROL_NONE        #language en-US        "None"
#string STR_CR_FLOW_CONTROL_HARDWARE    #language en-US        "RTS/CTS"
#string STR_CR_FLOW_CONTROL_SOFTWARE    #language en-US        "XON/XOFF"

#string STR_NAME_VALUE_VAR_NAME0        #language en-US        "CrNameValue"
													 
#string STR_CR_TERMINAL_RESIZE          #language en-US        "Auto adjust Terminal resolution"
#string STR_CR_TERMINAL_RESIZE_HELP     #language en-US        "Through send extra ESC sequencs code to adjust terminal resolution to fit host screen. \n\nSupporting terminals:\n1.PuTTY:\nPlease uncheck the \"Disable remote-controlled terminal resizing\" in Terminal->Features setting.\n\n2.Tera Term:\nPlease check the \"Term Size = win size\" in Setup->Terminal."

